Tekla Open API Reference for Tekla Structures 2025
PluginDescriptionAttribute Class
 Not supported at the moment.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.PluginDescriptionAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PluginDescriptionAttribute : Attribute
Public NotInheritable Class PluginDescriptionAttribute
	Inherits Attribute
The PluginDescriptionAttribute type exposes the following members.
Constructors
Name | Description
PluginDescriptionAttribute
 Not supported at the moment.
Top
Properties
Name | Description
Description
 Not supported at the moment.
Language
 Not supported at the moment.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace